InformationRegisters/КоэффициентыСтавкиРефинансированияНБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КоэффициентыСтавкиРефинансированияНБ</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНалоговВзносовОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНалоговВзносовОтчислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОППВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПоЗарплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоЗарплате</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АлиментыПрочиеИсполнительныеЛисты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлиментыПрочиеИсполнительныеЛистыКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозмещениеУщерба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВознаграждениеПлатежногоАгента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВознаграждениеПлатежногоАгентаКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыБывшимСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депонирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДивидендыСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольныеВзносыВНПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорАвторскогоЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорРаботыУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпускАвансом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпускОценочныеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпускОценочныеОбязательстваИРезервы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпускРезервы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЕжегодногоОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЕжегодногоОтпускаОценочныеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЗаЗадержкуЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяПомощь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НатуральныйДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленоДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленоПроцентовПоЗайму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленоСдельноДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛДоначисленныйПоРезультатамПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛПередачаЗадолженностиВНалоговыйОрган</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛПрочиеРасчетыСПерсоналом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛСПревышения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НФДЛДивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НФДЛДивидендыСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкаОбязательстваИФормированиеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЗаймов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаПогребение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профвзносы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоЗайму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСПерсоналом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеУдержания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРДополнительныйТарифЛЭ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРДополнительныйТарифШахтеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРДоПредельнойВеличины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРНакопительнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРПоСуммарномуТарифу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРСПревышения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФРСтраховаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованиюБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованиюРаботодатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованиюФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованиюФССНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеДепонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОППВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВПеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОППВПеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОПеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМСПеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМСДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООСМСПеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержаниеЗаОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержаниеНеизрасходованныхПодотчетныхСумм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержаниеПоПрочимОперациямСРаботниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФССНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыПоЕдиномуТарифу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНДивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМСРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМСДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕППеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВРПеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/КоэффициентыСтавкиРефинансированияНБ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
	
// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура НачальноеЗаполнение () Экспорт
	
	ЗаполнитьКоэффициентыСтавкиРефинансированияНБ();
	
КонецПроцедуры

Процедура ЗаполнитьКоэффициентыСтавкиРефинансированияНБ() Экспорт
	
	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.СоздатьНаборЗаписей();
	// обновляем коэффициенты ставок рефинансирования для базы в целом (установленные пользователем не трогаем)
	НаборЗаписей.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());

	// с 1 января 2015
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыНалоговВзносовОтчислений.ОПВ,	2.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыНалоговВзносовОтчислений.ОППВ,	2.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыНалоговВзносовОтчислений.СО,	2.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты, 1);
	
	// С 1 июля 2017
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20170701', Перечисления.ВидыНалоговВзносовОтчислений.ООСМС,	2.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20170701', Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС,	2.5);
	
	// с 1 января 2018
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ОПВ,	1.25);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ОППВ,	1.25);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.СО,	1.25);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ООСМС,	1.25);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС,	1.25);

	// с 1 мая 2020
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20200501', Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты, 1.25);

	// с 1 января 2024
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20240101', Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, 1.25);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, Период, ВидНалогаВзносаОтчисления, Коэффициент)
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;
	НоваяЗапись.ВидНалогаВзносаОтчисления = ВидНалогаВзносаОтчисления;
	НоваяЗапись.Коэффициент = Коэффициент;
	
КонецПроцедуры

Процедура ОбновитьСведенияКоэффициентыСтавкиРефинансированияНБ2020() Экспорт

	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.СоздатьНаборЗаписей();
	
	// с 1 января 2015
	НаборЗаписей.Отбор.Период.Установить('20150101');
	НаборЗаписей.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
	
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты, 1);
	
	НаборЗаписей.Записать(Истина);
	
	НаборЗаписей.Очистить();
	
	// с 1 мая 2020
	НаборЗаписей.Отбор.Период.Установить('20200501');
	НаборЗаписей.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
	
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20200501', Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты, 1.25);
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

Процедура ОбновитьСведенияКоэффициентыСтавкиРефинансированияНБ2024() Экспорт

	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.СоздатьНаборЗаписей();
	
	// с 1 января 2024
	НаборЗаписей.Отбор.Период.Установить('20240101');
	НаборЗаписей.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
	
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20240101', Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, 1.25);
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
